src/object-diagram/logic/test-suites/primitive-array-types/tests/stack-frame/writer/expected.gv
digraph ObjectDiagram {
  node [shape=plaintext]
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;[StackFrame]&gt;&gt;</i></td></th>
    <tr><td align="left">args</td><td align="left" port="args"></td></tr>
    <tr><td align="left">booleans</td><td align="left" port="booleans"></td></tr>
    <tr><td align="left">bytes</td><td align="left" port="bytes"></td></tr>
    <tr><td align="left">chars</td><td align="left" port="chars"></td></tr>
    <tr><td align="left">shorts</td><td align="left" port="shorts"></td></tr>
    <tr><td align="left">ints</td><td align="left" port="ints"></td></tr>
    <tr><td align="left">longs</td><td align="left" port="longs"></td></tr>
    <tr><td align="left">floats</td><td align="left" port="floats"></td></tr>
    <tr><td align="left">doubles</td><td align="left" port="doubles"></td></tr>
  </table>>]
  _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[]</td></tr>
  </table>>]
  _a7b8693ef34c95429601339e93379f6a889a0117 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;boolean[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[false]</td></tr>
  </table>>]
  _62fc0855040a9e18089cfba11a18b8b2dd6036ed [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;byte[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[0]</td></tr>
  </table>>]
  _c4038b4808c6c13845c534f84a12990c7f996830 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;char[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[\u0000]</td></tr>
  </table>>]
  _d0d806b0c2a22e0831cc86f136c2d761dabc3693 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;short[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[0]</td></tr>
  </table>>]
  _1a39cae2fdfb5c9759592bd1dd7b129fd06eb1bd [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;int[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[0]</td></tr>
  </table>>]
  _dc2796f1367e70d585ec072b4370425c2de23aba [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;long[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[0]</td></tr>
  </table>>]
  _08c49eb5b046fb06d4378a2979a2f6344414bfa5 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;float[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[0.000000]</td></tr>
  </table>>]
  _3bf981107596a21c2b5a0bfb5db7d2ce37b6080a [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;double[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[0.000000]</td></tr>
  </table>>]
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:args -> _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:booleans -> _a7b8693ef34c95429601339e93379f6a889a0117
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:bytes -> _62fc0855040a9e18089cfba11a18b8b2dd6036ed
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:chars -> _c4038b4808c6c13845c534f84a12990c7f996830
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:shorts -> _d0d806b0c2a22e0831cc86f136c2d761dabc3693
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:ints -> _1a39cae2fdfb5c9759592bd1dd7b129fd06eb1bd
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:longs -> _dc2796f1367e70d585ec072b4370425c2de23aba
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:floats -> _08c49eb5b046fb06d4378a2979a2f6344414bfa5
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:doubles -> _3bf981107596a21c2b5a0bfb5db7d2ce37b6080a
}
