src/object-diagram/logic/test-suites/primitive-array-types/tests/stack-frame/writer/expected.puml
@startuml
map "<<[StackFrame]>>" as _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352 {
  args =>
  booleans =>
  bytes =>
  chars =>
  shorts =>
  ints =>
  longs =>
  floats =>
  doubles =>
}
object "<<String[]>>" as _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889 {
  []
}
object "<<boolean[]>>" as _a7b8693ef34c95429601339e93379f6a889a0117 {
  [false]
}
object "<<byte[]>>" as _62fc0855040a9e18089cfba11a18b8b2dd6036ed {
  [0]
}
object "<<char[]>>" as _c4038b4808c6c13845c534f84a12990c7f996830 {
  [\u0000]
}
object "<<short[]>>" as _d0d806b0c2a22e0831cc86f136c2d761dabc3693 {
  [0]
}
object "<<int[]>>" as _1a39cae2fdfb5c9759592bd1dd7b129fd06eb1bd {
  [0]
}
object "<<long[]>>" as _dc2796f1367e70d585ec072b4370425c2de23aba {
  [0]
}
object "<<float[]>>" as _08c49eb5b046fb06d4378a2979a2f6344414bfa5 {
  [0.000000]
}
object "<<double[]>>" as _3bf981107596a21c2b5a0bfb5db7d2ce37b6080a {
  [0.000000]
}
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::args ==> _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::booleans ==> _a7b8693ef34c95429601339e93379f6a889a0117
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::bytes ==> _62fc0855040a9e18089cfba11a18b8b2dd6036ed
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::chars ==> _c4038b4808c6c13845c534f84a12990c7f996830
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::shorts ==> _d0d806b0c2a22e0831cc86f136c2d761dabc3693
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::ints ==> _1a39cae2fdfb5c9759592bd1dd7b129fd06eb1bd
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::longs ==> _dc2796f1367e70d585ec072b4370425c2de23aba
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::floats ==> _08c49eb5b046fb06d4378a2979a2f6344414bfa5
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::doubles ==> _3bf981107596a21c2b5a0bfb5db7d2ce37b6080a
@enduml
